In [3]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [18]:
df = pd.read_csv('Final_Agmarknet_MCDF.csv')

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6807 entries, 0 to 6806
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   State Name                 6807 non-null   object
 1   District Name              6807 non-null   object
 2   Market Name                6807 non-null   object
 3   Variety                    6807 non-null   object
 4   Group                      6807 non-null   object
 5   Arrivals (Tonnes)          6807 non-null   float64
 6   Min Price (Rs./Quintal)    6807 non-null   int64
 7   Max Price (Rs./Quintal)    6807 non-null   int64
 8   Modal Price (Rs./Quintal)  6807 non-null   int64
 9   Reported Date              6807 non-null   object
 10  Grade                      6807 non-null   object
dtypes: float64(1), int64(3), object(7)
memory usage: 585.1+ KB

# Clean the Data

## Replacing all blanks with '_' in all column names

In [20]:
new_cols = []
for col in df.columns:
    new_cols.append(col.replace(' ','_'))

df.columns = new_cols
df.columns

Index(['State_Name', 'District_Name', 'Market_Name', 'Variety', 'Group',
       'Arrivals_(Tonnes)', 'Min_Price_(Rs./Quintal)',
       'Max_Price_(Rs./Quintal)', 'Modal_Price_(Rs./Quintal)', 'Reported_Date',
       'Grade'],
      dtype='object')

## replace multiple patterns in column names programmatically using RegEx.

In [21]:
df.columns = df.columns.str.replace(r"\(|\)|\.", "", regex=True).str.replace("/", "_")

In [22]:
df.columns

Index(['State_Name', 'District_Name', 'Market_Name', 'Variety', 'Group',
       'Arrivals_Tonnes', 'Min_Price_Rs_Quintal', 'Max_Price_Rs_Quintal',
       'Modal_Price_Rs_Quintal', 'Reported_Date', 'Grade'],
      dtype='object')

In [23]:
df.head(10)

,State_Name,District_Name,Market_Name,Variety,Group,Arrivals_Tonnes,Min_Price_Rs_Quintal,Max_Price_Rs_Quintal,Modal_Price_Rs_Quintal,Reported_Date,Grade
0,Maharashtra,Kolhapur,Vadgaonpeth,Beans,Pulses,0.3,2000,3500,2800,23 Mar 2025,Local
1,Maharashtra,Kolhapur,Vadgaonpeth,Beans,Pulses,0.3,2500,2800,2600,19 Aug 2025,Local
2,Maharashtra,Kolhapur,Vadgaonpeth,Beans,Pulses,0.3,2800,3500,3000,03 Jun 2025,Local
3,Maharashtra,Kolhapur,Vadgaonpeth,Beans,Pulses,0.3,2800,3500,3000,12 Apr 2025,Local
4,Maharashtra,Kolhapur,Vadgaonpeth,Beans,Pulses,0.3,2800,3500,3000,30 Jan 2025,Local
5,Maharashtra,Kolhapur,Vadgaonpeth,Beans,Pulses,0.3,3000,3500,3300,10 May 2025,Local
6,Maharashtra,Kolhapur,Vadgaonpeth,Beans,Pulses,0.3,3000,4000,3500,03 May 2025,Local
7,Maharashtra,Kolhapur,Vadgaonpeth,Beans,Pulses,0.3,3000,4000,3500,04 Mar 2025,Local
8,Maharashtra,Kolhapur,Vadgaonpeth,Beans,Pulses,0.3,3000,4000,3500,15 Feb 2025,Local
9,Maharashtra,Kolhapur,Vadgaonpeth,Beans,Pulses,0.3,3000,4000,3500,26 Apr 2025,Local

In [24]:
df['Variety'].unique()

array(['Beans', 'Brinjal', 'Cabbage', 'Garlic', 'Onion', 'Red', 'Potato',
       'Tomato', 'Local'], dtype=object)

### Convert Arrivals (Tonnes) to numeric

In [25]:
df['Arrivals_Tonnes'] = pd.to_numeric(df['Arrivals_Tonnes'], errors='coerce')

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6807 entries, 0 to 6806
Data columns (total 11 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   State_Name              6807 non-null   object
 1   District_Name           6807 non-null   object
 2   Market_Name             6807 non-null   object
 3   Variety                 6807 non-null   object
 4   Group                   6807 non-null   object
 5   Arrivals_Tonnes         6807 non-null   float64
 6   Min_Price_Rs_Quintal    6807 non-null   int64
 7   Max_Price_Rs_Quintal    6807 non-null   int64
 8   Modal_Price_Rs_Quintal  6807 non-null   int64
 9   Reported_Date           6807 non-null   object
 10  Grade                   6807 non-null   object
dtypes: float64(1), int64(3), object(7)
memory usage: 585.1+ KB

## Accessing the null value in arrival column

In [27]:
df[(df['Arrivals_Tonnes'].isna()) == True]

Empty DataFrame
Columns: [State_Name, District_Name, Market_Name, Variety, Group, Arrivals_Tonnes, Min_Price_Rs_Quintal, Max_Price_Rs_Quintal, Modal_Price_Rs_Quintal, Reported_Date, Grade]
Index: []

**Note:** There is no Missing values in DataSet.

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6807 entries, 0 to 6806
Data columns (total 11 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   State_Name              6807 non-null   object
 1   District_Name           6807 non-null   object
 2   Market_Name             6807 non-null   object
 3   Variety                 6807 non-null   object
 4   Group                   6807 non-null   object
 5   Arrivals_Tonnes         6807 non-null   float64
 6   Min_Price_Rs_Quintal    6807 non-null   int64
 7   Max_Price_Rs_Quintal    6807 non-null   int64
 8   Modal_Price_Rs_Quintal  6807 non-null   int64
 9   Reported_Date           6807 non-null   object
 10  Grade                   6807 non-null   object
dtypes: float64(1), int64(3), object(7)
memory usage: 585.1+ KB

## Drop unwanted rows (like Sub Totals / Total)

In [29]:
df = df[~df['District_Name'].str.contains('Total', na=False)]

## Renaming Columns for better readability

In [30]:
df = df.rename(columns = {'Reported_Date':'Report_Date','Modal_Price_Rs_Quintal':'Average_Price_Per_Quintal','Min_Price_Rs_Quintal':'Min_Price_Per_Quintal','Max_Price_Rs_Quintal':'Max_Price_Per_Quintal'})

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6807 entries, 0 to 6806
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   State_Name                 6807 non-null   object
 1   District_Name              6807 non-null   object
 2   Market_Name                6807 non-null   object
 3   Variety                    6807 non-null   object
 4   Group                      6807 non-null   object
 5   Arrivals_Tonnes            6807 non-null   float64
 6   Min_Price_Per_Quintal      6807 non-null   int64
 7   Max_Price_Per_Quintal      6807 non-null   int64
 8   Average_Price_Per_Quintal  6807 non-null   int64
 9   Report_Date                6807 non-null   object
 10  Grade                      6807 non-null   object
dtypes: float64(1), int64(3), object(7)
memory usage: 585.1+ KB

In [32]:
df.shape

(6807, 11)

## converting Report Date column to datetime

In [33]:
df['Reported Date'] = pd.to_datetime(
    df['Report_Date'].str.strip(),  # remove extra spaces
    format="%d %b %Y",  # example: "03 Jun 2025"
    errors="coerce"     # still gives NaT if mismatch
)

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6807 entries, 0 to 6806
Data columns (total 12 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   State_Name                 6807 non-null   object
 1   District_Name              6807 non-null   object
 2   Market_Name                6807 non-null   object
 3   Variety                    6807 non-null   object
 4   Group                      6807 non-null   object
 5   Arrivals_Tonnes            6807 non-null   float64
 6   Min_Price_Per_Quintal      6807 non-null   int64
 7   Max_Price_Per_Quintal      6807 non-null   int64
 8   Average_Price_Per_Quintal  6807 non-null   int64
 9   Report_Date                6807 non-null   object
 10  Grade                      6807 non-null   object
 11  Reported Date              6807 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(3), object(7)
memory usage: 638.3+ KB

## Droping State and Grade column
- We choosen the Maharashtra's Agriculture data random district wise, so their is state name remain same for all district.
- not necessory to have Grade in our data.

In [ ]:
df = df.drop(columns = ['State_Name','Grade'])
df = df.drop(columns = ['Reported Date])

In [42]:
df.head()

,District_Name,Market_Name,Variety,Group,Arrivals_Tonnes,Min_Price_Per_Quintal,Max_Price_Per_Quintal,Average_Price_Per_Quintal,Report_Date
1328,Nashik,Nasik,Brinjal,Vegetables,41.8,2000,4000,3000,01 Apr 2025
1608,Thane,Kalyan,Brinjal,Vegetables,0.3,3000,4000,3500,01 Apr 2025
4054,Thane,Kalyan,Garlic,Spices,0.3,6000,8000,7000,01 Apr 2025
6018,Nashik,Nasik,Tomato,Vegetables,213.6,250,800,500,01 Apr 2025
2374,Nashik,Nasik,Cabbage,Vegetables,82.6,250,460,330,01 Apr 2025

In [37]:
df.dtypes

District_Name                        object
Market_Name                          object
Variety                              object
Group                                object
Arrivals_Tonnes                     float64
Min_Price_Per_Quintal                 int64
Max_Price_Per_Quintal                 int64
Average_Price_Per_Quintal             int64
Report_Date                          object
Reported Date                datetime64[ns]
dtype: object

## Sorting the dataframe by Report_Date

In [38]:
df = df.sort_values('Report_Date')
df.head()

,District_Name,Market_Name,Variety,Group,Arrivals_Tonnes,Min_Price_Per_Quintal,Max_Price_Per_Quintal,Average_Price_Per_Quintal,Report_Date,Reported Date
1328,Nashik,Nasik,Brinjal,Vegetables,41.8,2000,4000,3000,01 Apr 2025,2025-04-01
1608,Thane,Kalyan,Brinjal,Vegetables,0.3,3000,4000,3500,01 Apr 2025,2025-04-01
4054,Thane,Kalyan,Garlic,Spices,0.3,6000,8000,7000,01 Apr 2025,2025-04-01
6018,Nashik,Nasik,Tomato,Vegetables,213.6,250,800,500,01 Apr 2025,2025-04-01
2374,Nashik,Nasik,Cabbage,Vegetables,82.6,250,460,330,01 Apr 2025,2025-04-01

## converting csv

In [41]:
df.to_csv("EDA_MCDF.csv", index=False)